# DataFrame

## DataFrame的创建方法

直接定义-pd.DataFrame()

In [1]:
# -*- coding:utf-8 -*-
import numpy as np
import pandas as pd
df1 = pd.DataFrame(np.arange(10).reshape(2,5))
df1

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

导入定义

In [2]:
df2 = pd.read_csv("es50.txt",sep=";",dayfirst=True)
df2.shape

(7673, 10)

In [3]:
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.head() # 头几行

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

In [4]:
df2.tail() # 尾几行

             找增增     SX5P     SX5E    SXXP
7668  28.09.2016  2846.55  2991.11  342.57
7669  29.09.2016  2848.93  2991.58  342.72
7670  30.09.2016  2843.17  3002.24  342.92
7671  03.10.2016  2845.43  2998.50  343.23
7672  04.10.2016  2871.06  3029.50  346.10

## 查看行或列

查看行名，显式索引

In [5]:
df2.index

RangeIndex(start=0, stop=7673, step=1)

计算行数

In [6]:
df2.index.size

7673

查看列名：列的显式索引

In [7]:
df2.columns

Index(['找增增', 'SX5P', 'SX5E', 'SXXP'], dtype='object')

计算列数

In [8]:
df2.columns.size

4

同时显示行数和列数

In [9]:
df2.shape

(7673, 4)

计算行数和列数的另一种方法

In [10]:
print("行数为：", df2.shape[0])
print("列数为：", df2.shape[1])

行数为： 7673
列数为： 4

## 引用行或列

显式可以通过切片[]获取，隐式只能用 iloc

python中，通过 iloc 达到下标表示方法

In [11]:
df2.iloc[1, 0]

'01.01.1987'

按列名读取

第一种写法--列明出现在下表中

In [12]:
df2["找增增"].head()

0    31.12.1986
1    01.01.1987
2    02.01.1987
3    05.01.1987
4    06.01.1987
Name: 找增增, dtype: object

第二种写法--可将列名当作数据框的一个属性来用

In [13]:
df2.找增增.head()

0    31.12.1986
1    01.01.1987
2    02.01.1987
3    05.01.1987
4    06.01.1987
Name: 找增增, dtype: object

第三种写法--列明和行号一起用

In [14]:
df2["找增增"][2]

'02.01.1987'

第四种写法--属性名和行号一起用

In [15]:
df2.找增增[2]

'02.01.1987'

第五种写法--用切片

In [16]:
df2["找增增"][[2, 4]]

2    02.01.1987
4    06.01.1987
Name: 找增增, dtype: object

python 中，每个数据框有两种 index 索引，一种隐式，一种显式

loc 表示的是显式index

iloc 表示的是隐式index

In [17]:
df2.loc[1, "找增增"]

'01.01.1987'

In [18]:
df2.iloc[1, 0] # 行，列

'01.01.1987'

按显式 index 访问非连续元素

In [19]:
df2[["找增增", "SX5P"]].head()

          找增增    SX5P
0  31.12.1986  775.00
1  01.01.1987  775.00
2  02.01.1987  770.89
3  05.01.1987  771.89
4  06.01.1987  775.92

## index 操作

行显式 index 的名称： index
列显式 index 的名称： columns

In [20]:
df2.index

RangeIndex(start=0, stop=7673, step=1)

In [21]:
df2.columns

Index(['找增增', 'SX5P', 'SX5E', 'SXXP'], dtype='object')

显式 index 读取

In [22]:
df2["找增增"].head()

0    31.12.1986
1    01.01.1987
2    02.01.1987
3    05.01.1987
4    06.01.1987
Name: 找增增, dtype: object

更改显式 index 的方法：用 reindex() 方法

并不是重新给出新的 index，而是调整 index 的顺序，原对象不变，会有返回值

In [23]:
df2.reindex(index = ["1", "2", "3"], columns = ["1", "2", "3"])
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

In [24]:
df2.reindex(index = [2, 3, 1], columns = ["SX5P", "找增增", "SX5E", "SXXP"])

     SX5P         找增增    SX5E   SXXP
2  770.89  02.01.1987  891.78  82.57
3  771.89  05.01.1987  898.33  82.82
1  775.00  01.01.1987  900.82  82.76

在重新索引是可以新增一个显式 index

In [25]:
df3 = df2.reindex(index = [2, 3, 1], columns = ["SX5P", "找增增", "SX5E", "SXXP", "MyNewColumn"],fill_value = 100)
df3

     SX5P         找增增    SX5E   SXXP  MyNewColumn
2  770.89  02.01.1987  891.78  82.57          100
3  771.89  05.01.1987  898.33  82.82          100
1  775.00  01.01.1987  900.82  82.76          100

## 删除或过滤 行/列

In [26]:
import pandas as pd
df2 = pd.read_csv("es50.txt",sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

In [27]:
# drop() 方法不改变DataFrame本身
df2.drop([2]).head() # 下标中的 2 为显式 index

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28
5  07.01.1987  781.21  899.15  83.78

In [28]:
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

axis = 0 的含义：计算前后的列数不变；以行为单位计算；逐行计算  axis = 1 就是列的修改

In [29]:
# 这个drop()改变了原值
import pandas as pd

df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.drop([3, 4], axis = 0, inplace = True) # 如果前两行代码没有写，反复运行此代码会报错，因为 df2 的值一直在发生变化
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
5  07.01.1987  781.21  899.15  83.78
6  08.01.1987  777.62  887.37  83.52

python 中的一个重要参数：inplace

功能：是否要修改 DataFrame 对象本身（就地修改）

修改就不return对象，不修改就return对象

In [30]:
import pandas as pd

df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.drop(["找增增"], axis = 1, inplace = False)
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

删除列的第一个方法--切片操作 del 都修改原对象

In [31]:
import pandas as pd
df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
del df2["找增增"]
df2.head()

     SX5P    SX5E   SXXP
0  775.00  900.82  82.76
1  775.00  900.82  82.76
2  770.89  891.78  82.57
3  771.89  898.33  82.82
4  775.92  902.32  83.28

删除列的第二个方法--用方法 drop()

In [32]:
df2.drop(["SX5P", "SX5E"], axis = 1, inplace = True)
df2.head()

    SXXP
0  82.76
1  82.76
2  82.57
3  82.82
4  83.28

按列条件过滤方法--在“下标”中写过滤条件

In [33]:
import pandas as pd
df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2[df2.SX5P > 899].head()

            找增增    SX5P    SX5E   SXXP
118  15.06.1987  899.33  879.82  94.53
119  16.06.1987  902.37  885.41  95.05
120  17.06.1987  905.03  885.93  95.29
124  23.06.1987  907.32  915.58  94.98
125  24.06.1987  904.50  901.60  94.88

In [34]:
df2[df2.SX5P > 899][["找增增", "SX5P"]].head()

            找增增    SX5P
118  15.06.1987  899.33
119  16.06.1987  902.37
120  17.06.1987  905.03
124  23.06.1987  907.32
125  24.06.1987  904.50

## 算术运算

规则之一：数据框之间的计算规则--先补齐显式index(新增索引对应值为NaN),得到相同的结构后，再进行计算

In [36]:
df4 = pd.DataFrame(np.arange(6).reshape(2,3))
df4

   0  1  2
0  0  1  2
1  3  4  5

In [39]:
df5 = pd.DataFrame(np.arange(10).reshape(2, 5))
df5

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [40]:
df4 + df5

   0   1   2   3   4
0  0   2   4 NaN NaN
1  8  10  12 NaN NaN

规则之二：用算术运算符 +、-、* 等会产生 NaN 值，如果想将默认填充的 NaN 改为指定值，建议不要使用算术运算符，改用成员方法。算数运算符通常不用

如add()、sub()、mul()、div()

In [42]:
df6 = df4.add(df5, fill_value = 10)
df6

   0   1   2     3     4
0  0   2   4  13.0  14.0
1  8  10  12  18.0  19.0

规则之三：数据库昂与 Series 的计算规则 --- 按行(第一轴)广播，先把行改为等长，行内不做循环补齐。只是一行一行计算，不会跨行广播

In [43]:
s1 = pd.Series(np.arange(3))
s1

0    0
1    1
2    2
dtype: int32

In [44]:
df6 - s1

     0    1     2   3   4
0  0.0  1.0   2.0 NaN NaN
1  8.0  9.0  10.0 NaN NaN

In [45]:
df5 = pd.DataFrame(np.arange(10).reshape(2, 5))
s1 = pd.Series(np.arange(3))
df5 - s1

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

等价于成员方法 sub() 中 axis=1

In [46]:
df5 = pd.DataFrame(np.arange(10).reshape(2, 5))
s1 = pd.Series(np.arange(3))
df5.sub(s1, axis = 1)

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

改为按列(第0轴)计算的方法。都是先做等长，再以显式 index 为依据做计算

In [48]:
df5 = pd.DataFrame(np.arange(10).reshape(2, 5))
s1 = pd.Series(np.arange(3))
df5.sub(s1,axis = 0)

     0    1    2    3    4
0  0.0  1.0  2.0  3.0  4.0
1  4.0  5.0  6.0  7.0  8.0
2  NaN  NaN  NaN  NaN  NaN

In [49]:
df7 = pd.DataFrame(np.arange(20).reshape(4, 5))
df7

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [51]:
df7 + 2

    0   1   2   3   4
0   2   3   4   5   6
1   7   8   9  10  11
2  12  13  14  15  16
3  17  18  19  20  21

Python 提供了许多函数支持不同的处理需求

cumsum() 元素累加和

In [53]:
print(df7)  # 默认按列
print("df7.cumsum = ",df7.cumsum())

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
df7.cumsum =      0   1   2   3   4
0   0   1   2   3   4
1   5   7   9  11  13
2  15  18  21  24  27
3  30  34  38  42  46

以此计算相邻两个元素之和，即本元素与上一个元素之和

In [54]:
df7

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [56]:
df7.rolling(window = 2).sum() # rolling() 取一个区间（窗口）进行移动

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   5.0   7.0   9.0  11.0  13.0
2  15.0  17.0  19.0  21.0  23.0
3  25.0  27.0  29.0  31.0  33.0

In [58]:
df7.rolling(2, axis = 1).sum()

    0     1     2     3     4
0 NaN   1.0   3.0   5.0   7.0
1 NaN  11.0  13.0  15.0  17.0
2 NaN  21.0  23.0  25.0  27.0
3 NaN  31.0  33.0  35.0  37.0

协方差矩阵

In [59]:
df7.cov()

           0          1          2          3          4
0  41.666667  41.666667  41.666667  41.666667  41.666667
1  41.666667  41.666667  41.666667  41.666667  41.666667
2  41.666667  41.666667  41.666667  41.666667  41.666667
3  41.666667  41.666667  41.666667  41.666667  41.666667
4  41.666667  41.666667  41.666667  41.666667  41.666667

相关系数矩阵

In [60]:
df7.corr()

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0  1.0

数据框的转置

In [70]:
import pandas as pd
df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.T

,0,1,2,3,4,5,6,7,8,9,...,7663,7664,7665,7666,7667,7668,7669,7670,7671,7672
找增增,31.12.1986,01.01.1987,02.01.1987,05.01.1987,06.01.1987,07.01.1987,08.01.1987,09.01.1987,12.01.1987,13.01.1987,...,21.09.2016,22.09.2016,23.09.2016,26.09.2016,27.09.2016,28.09.2016,29.09.2016,30.09.2016,03.10.2016,04.10.2016
SX5P,775,775,770.89,771.89,775.92,781.21,777.62,769.8,775.07,770,...,2848.58,2891.55,2869.7,2825.06,2830.24,2846.55,2848.93,2843.17,2845.43,2871.06
SX5E,900.82,900.82,891.78,898.33,902.32,899.15,887.37,868.31,879.41,872.74,...,2982.18,3051.69,3032.31,2975.88,2970.84,2991.11,2991.58,3002.24,2998.5,3029.5
SXXP,82.76,82.76,82.57,82.82,83.28,83.78,83.52,83.03,83.64,83,...,342.46,347.86,345.34,340,340.19,342.57,342.72,342.92,343.23,346.1

## 大小比较运算

In [90]:
df6 = pd.DataFrame(np.arange(16).reshape(4, 4))
df6

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [91]:
df6 > 5

       0      1      2      3
0  False  False  False  False
1  False  False   True   True
2   True   True   True   True
3   True   True   True   True

In [92]:
print(s1)

0    0
1    1
2    2
dtype: int32

In [93]:
df6 > s1 # 广播原则

       0      1      2      3
0  False  False  False  False
1   True   True   True  False
2   True   True   True  False
3   True   True   True  False

In [94]:
df6 > (1, 3, 11, 14)

       0      1      2      3
0  False  False   True   True
1   True   True   True   True
2  False  False  False  False
3  False  False  False   True

## 统计信息

方法 describe() 是数据分析与数据科学项目中最常用的描述性统计方法之一

In [101]:
import numpy as np
import pandas as pd

df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.describe()

              SX5P         SX5E         SXXP
count  7673.000000  7673.000000  7673.000000
mean   2375.369913  2489.998315   228.571035
std    1091.535088  1168.258876    98.024506
min       0.000000     0.000000     0.000000
25%    1293.690000  1323.350000   125.460000
50%    2541.790000  2632.250000   241.940000
75%    3106.540000  3280.410000   308.570000
max    5183.240000  5464.430000   414.060000

In [107]:
dt = df2[df2.SX5P > 2540]
dt.head()

             找增增     SX5P     SX5E    SXXP
2737  03.07.1997  2542.85  2491.58  223.09
2738  04.07.1997  2560.10  2509.09  223.33
2739  07.07.1997  2580.00  2531.84  224.95
2740  08.07.1997  2569.39  2520.46  224.49
2741  09.07.1997  2583.64  2544.62  225.87

In [108]:
dt.tail()

             找增增     SX5P     SX5E    SXXP
7668  28.09.2016  2846.55  2991.11  342.57
7669  29.09.2016  2848.93  2991.58  342.72
7670  30.09.2016  2843.17  3002.24  342.92
7671  03.10.2016  2845.43  2998.50  343.23
7672  04.10.2016  2871.06  3029.50  346.10

频次统计 -- count() 方法

In [113]:
df2[df2.SX5P > 2540].count()

找增增     3849
SX5P    3849
SX5E    3849
SXXP    3849
dtype: int64

## 排序

In [114]:
df2.head(8)

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28
5  07.01.1987  781.21  899.15  83.78
6  08.01.1987  777.62  887.37  83.52
7  09.01.1987  769.80  868.31  83.03

按值排序 -- sort_values() 方法

In [115]:
df2.sort_values(by = "SX5P", axis = 0, ascending = True).head() # ascending 上升，从小到大

             找增增    SX5P    SX5E   SXXP
7536  28.03.2016    0.00    0.00   0.00
7535  25.03.2016    0.00    0.00   0.00
224   10.11.1987  626.09  615.90  66.69
242   04.12.1987  628.76  635.83  67.93
243   07.12.1987  629.56  634.13  67.98

In [117]:
df2.sort_index(axis = 1).head()

     SX5E    SX5P   SXXP         找增增
0  900.82  775.00  82.76  31.12.1986
1  900.82  775.00  82.76  01.01.1987
2  891.78  770.89  82.57  02.01.1987
3  898.33  771.89  82.82  05.01.1987
4  902.32  775.92  83.28  06.01.1987

In [119]:
df2.sort_index(axis = 0, ascending = False).head()

             找增增     SX5P     SX5E    SXXP
7672  04.10.2016  2871.06  3029.50  346.10
7671  03.10.2016  2845.43  2998.50  343.23
7670  30.09.2016  2843.17  3002.24  342.92
7669  29.09.2016  2848.93  2991.58  342.72
7668  28.09.2016  2846.55  2991.11  342.57

## 导入/导出

导入导出前提：需要知道当前工作目录位置

In [120]:
import os
print(os.getcwd())

D:\Install\Jupyter\python基础

导出方法 -- 用系列方法 .to_***()

In [123]:
df2.head(3).to_csv("df2.csv")

读入方法 -- 用系列方法 read_***()

In [124]:
import pandas as pd
df3 = pd.read_csv("df2.csv")
df3

   Unnamed: 0         找增增    SX5P    SX5E   SXXP
0           0  31.12.1986  775.00  900.82  82.76
1           1  01.01.1987  775.00  900.82  82.76
2           2  02.01.1987  770.89  891.78  82.57

## 缺省数据处理

这种结构不一致的都是小的先做填补，再做计算

判断一个数据框是否为空数据框 -- 属性 .empty()

In [126]:
df3.empty

False

Python 举出语法与 pandas 中对 None 和 NaN 的处理方法不同：

python基础语法中，None 不能参与计算，NaN 可以参与计算

pandas中二者都可以参加计算，将 None 自动转换为 np.nan-np.nan+1

In [128]:
np.nan - np.nan + 1

nan

In [129]:
np.nan - np.nan

nan

In [130]:
import pandas as pd
import numpy as np
A = pd.DataFrame(np.array([10, 10, 20, 20]).reshape(2, 2), columns = list("ab"), index = list("SW"))
A

    a   b
S  10  10
W  20  20

In [133]:
B = pd.DataFrame(np.array([1, 1, 1, 2, 2, 2, 3, 3, 3]).reshape(3, 3), columns = list("abc"), index = list("SWT"))
B

   a  b  c
S  1  1  1
W  2  2  2
T  3  3  3

In [135]:
C = A + B
C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [136]:
A.add(B, fill_value = 0)

      a     b    c
S  11.0  11.0  1.0
T   3.0   3.0  3.0
W  22.0  22.0  2.0

In [137]:
A.add(B, fill_value = A.stack().mean()) # 缺省值用“均值”插补

      a     b     c
S  11.0  11.0  16.0
T  18.0  18.0  18.0
W  22.0  22.0  17.0

In [138]:
A.mean()

a    15.0
b    15.0
dtype: float64

In [141]:
A.stack() # 建立多极索引，是numpy的一个常用方法

S  a    10
   b    10
W  a    20
   b    20
dtype: int32

In [142]:
A.stack().mean()

15.0

DataFrame 缺省值处理的四个重要函数：

isnull()

notnull()

dropna()

fillna()

In [143]:
C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [146]:
C.isnull() # 判断每个元素是否为空

       a      b     c
S  False  False  True
T   True   True  True
W  False  False  True

In [147]:
C.notnull() # 判断每个元素是否为非空

       a      b      c
S   True   True  False
T  False  False  False
W   True   True  False

In [150]:
C.dropna(axis = "index") # 直接删除缺省值，axis = "index" 凡是含有缺省值的行均被删除 columns 为列

Empty DataFrame
Columns: []
Index: [S, T, W]

In [152]:
C.fillna(0) # 设置缺省值的填补

      a     b    c
S  11.0  11.0  0.0
T   0.0   0.0  0.0
W  22.0  22.0  0.0

In [156]:
C.fillna(method = "ffill") # ffill 的含义是向前(上)填充

      a     b   c
S  11.0  11.0 NaN
T  11.0  11.0 NaN
W  22.0  22.0 NaN

In [160]:
C.fillna(method = "bfill", axis = 1) # bfill 向后填充

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

## 分组统计

In [161]:
import pandas as pd
df2 = pd.read_csv("es50.txt", sep = ";")
df2 = df2[["找增增", "SX5P", "SX5E", "SXXP"]]
df2.head()

          找增增    SX5P    SX5E   SXXP
0  31.12.1986  775.00  900.82  82.76
1  01.01.1987  775.00  900.82  82.76
2  02.01.1987  770.89  891.78  82.57
3  05.01.1987  771.89  898.33  82.82
4  06.01.1987  775.92  902.32  83.28

groupby 的用法如下：

（1）后接一个圆括号和一个方括号

圆括号中为分组条件,分组依据

方括号中为计算对象，需要参与统计的变量

（2）再接一个方法，如 sum() 和 mean() 分组后用于统计的函数

In [176]:
df2.groupby("找增增")["SX5P"].mean().head()

找增增
01.01.1987    775.00
01.01.1988    651.26
01.01.1990    980.22
01.01.1991    835.34
01.02.1988    659.42
Name: SX5P, dtype: float64

In [168]:
df2.groupby("找增增")["SX5P"].aggregate(["mean", "sum", "max", np.median]).head() # .aggregate()， 同时计算多个函数的值

              mean     sum     max  median
找增增
01.01.1987  775.00  775.00  775.00  775.00
01.01.1988  651.26  651.26  651.26  651.26
01.01.1990  980.22  980.22  980.22  980.22
01.01.1991  835.34  835.34  835.34  835.34
01.02.1988  659.42  659.42  659.42  659.42

In [174]:
df2.groupby("找增增")["SX5P"].aggregate(["mean", "max"]).unstack() # unstack() 的功能为“将关系表转换为二级索引”

      找增增
mean  01.01.1987     775.00
      01.01.1988     651.26
      01.01.1990     980.22
      01.01.1991     835.34
      01.02.1988     659.42
      01.02.1989     842.93
      01.02.1990     973.37
      01.02.1991     853.71
      01.02.1993    1050.25
      01.02.1994    1453.53
      01.02.1995    1284.07
      01.02.1996    1593.38
      01.02.1999    3510.21
      01.02.2000    4631.64
      01.02.2001    4493.01
      01.02.2002    3604.59
      01.02.2005    2844.20
      01.02.2006    3474.92
      01.02.2007    3805.38
      01.02.2008    3300.97
      01.02.2010    2490.83
      01.02.2011    2696.13
      01.02.2012    2463.23
      01.02.2013    2640.10
      01.02.2016    2893.97
      01.03.1988     690.97
      01.03.1989     814.95
      01.03.1990     940.72
      01.03.1991     931.84
      01.03.1993    1105.35
                     ...
max   31.10.2000    4953.48
      31.10.2001    3465.74
      31.10.2002    2561.29
      31.10.2003    2537.84
      31.10.2005    3201.79
      31.10.2006    3669.15
      31.10.2007    3885.12
      31.10.2008    2331.43
      31.10.2011    2318.00
      31.10.2012    2525.03
      31.10.2013    2878.42
      31.10.2014    2998.27
      31.12.1986     775.00
      31.12.1987     651.26
      31.12.1990     835.34
      31.12.1991    1000.00
      31.12.1992    1057.56
      31.12.1993    1429.10
      31.12.1996    1850.10
      31.12.1997    2633.63
      31.12.2003    2660.37
      31.12.2004    2775.33
      31.12.2007    3683.79
      31.12.2008    2083.90
      31.12.2009    2585.33
      31.12.2010    2586.46
      31.12.2012    2577.62
      31.12.2013    2919.42
      31.12.2014    3003.95
      31.12.2015    3100.26
Length: 15346, dtype: float64

如果将第三个位置上的函数替换成自定义函数，则用方法 apply()

In [182]:
def myfunc(x):
    x["SX5P"]  = "1000.00"
    return x
df2.groupby("找增增").apply(myfunc).head()

          找增增     SX5P    SX5E   SXXP
0  31.12.1986  1000.00  900.82  82.76
1  01.01.1987  1000.00  900.82  82.76
2  02.01.1987  1000.00  891.78  82.57
3  05.01.1987  1000.00  898.33  82.82
4  06.01.1987  1000.00  902.32  83.28